Wouldn't it be easier to just use the list in the for_each?

This seems to work:
```hcl
locals {
  rules = [
    { priority = 2 },
    { priority = 3 },
    { priority = 10 },
    { priority = 150 },
  ]
}

resource "google_compute_url_map" "urlmap" {
  name            = "urlmap"
  default_service = "service"
  project         = "myproject"

  path_matcher {
    name = "name"
    dynamic "route_rules" {
      for_each = local.rules
      content {
        priority = route_rules.value.priority
      }
    }
  }
}
```

```
Terraform will perform the following actions:

  # google_compute_url_map.urlmap will be created
  + resource "google_compute_url_map" "urlmap" {
      + creation_timestamp = (known after apply)
      + default_service    = "service"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "urlmap"
      + project            = "myproject"
      + self_link          = (known after apply)

      + path_matcher {
          + name = "name"

          + route_rules {
              + priority = 2
            }
          + route_rules {
              + priority = 3
            }
          + route_rules {
              + priority = 10
            }
          + route_rules {
              + priority = 150
            }
        }
    }
```

```